Ran Plan for 4 projects:

1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
1. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
1. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
1. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`

### 1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # google_compute_address.asg[1] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-0c66dbc4"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-east4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T23:28:14.368-07:00"
        id                 = "projects/2036174436/zones/us-west4-b/autoscalers/frontend-amer-us-west4"
        name               = "frontend-amer-us-west4"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/autoscalers/frontend-amer-us-west4"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/instanceGroupManagers/frontend-group-manager-amer-us-west4" -> "projects/2036174436/zones/us-west4-b/instanceGroupManagers/frontend-group-manager-amer-us-west4"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b"

        autoscaling_policy {
            cooldown_period = 60
            max_replicas    = 3
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_autoscaler.asg[1] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-amer-us-east4"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "us-east4-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 3
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_backend_service.asg[1] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "frontend-svc-amer-us-east4"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_forwarding_rule.asg[1] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "frontend-forwarding-rule-us-east4"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "us-east4"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_http_health_check.asg[1] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "asg-health-check-us-east4"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.asg[1] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-amer-us-east41"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "frontend-group-manager-amer-us-east4"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "us-east4-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200923060212246700000001"
        }
    }

  # google_compute_target_pool.asg[1] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-us-east4",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "frontend-target-pool-us-east4"
      + project          = (known after apply)
      + region           = "us-east4"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_dns_record_set.asg[1] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.us-east4.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 8 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
### 2. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_autoscale`

---
### 3. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_ocea_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Focea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_ocea_autoscale`

---
### 4. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_euro_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_euro_autoscale`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
